{
  "aboutMe": "Hello! I am a skilled web developer with over 2 years of hands-on experience, specialized in creating user-centric web solutions that prioritize the user experience and accessibility. My journey began at a regional bank, where I collaborated closely with clients as a customer service specialist. Later, I worked with different stakeholders as a business process analyst, which ignited my love for programming and I had the chance to join a coding bootcamp. There, I mastered programming fundamentals, adopted a team-oriented approach, and became more proficient with the basic tools for my daily tasks. Since then, I've been working as a web app developer, consistently pushing boundaries in the digital world. Recently, I relocated to the Netherlands, eager to embrace new challenges. I invite you to review my resume and connect with me to explore how I can contribute to your team.",
  "experience": [
    {
      "name": "Career Mentoring",
      "url": "",
      "position": "Freelance FrontEnd Developer",
      "dates": "Nov 2023 - Current",
      "company_type": "Start Up",
      "job_description": "Creation, testing, and enhancement of company app's user interface.",
      "tasks": [
        "Develop new user-facing features using HTML5, CSS3, and JavaScript (Angular)",
        "Work closely with backend team to integrate frontend components with server-side logic.",
        "Participate in code reviews and provide constructive feedback to peers.",
        "Contribute to the overall improvement of development processes and methodologies.",
        "Building APIs to meet client needs.",
        "Troubleshoot and debug issues promptly.",
        "Conduct unit tests to align with business requirements."
      ],
      "tools": [
        "Angular 17",
        "JavaScript",
        "Typescript",
        "Bootstrap",
        "HTML/CSS",
        "Gitlab",
        "ClickUp",
        "Slack"
      ]
    },
    {
      "name": "Accenture",
      "url": "https://www.accenture.com/",
      "position": "Application Web Developer",
      "dates": "March 2022 - Nov 2023",
      "company_type": "Global professional services company",
      "job_description": "Designing, building, and configuring cloud-based internal applications to align with business needs. Taking part of the entire software development lifecycle from analysis to maintenance, including manual testing. Collaborating within an agile team with strong English proficiency, partnering with a US-based team.",
      "tasks": [
        "Develop, test, and maintain high-quality software using mainly .NET Core, Angular and VueJS frameworks.",
        "Collaborate with cross-functional teams to understand project requirements and deliver solutions.",
        "Participate in all phases of the software development lifecycle, including design, development & testing.",
        "Advocate for clean, well-structured, and documented code following best practices and coding standards.",
        "Troubleshoot and debug issues to ensure optimal performance.",
        "Contribute to the continuous improvement of development processes and methodologies.",
        "Communicate effectively with team members to provide status updates, report issues, and seek feedback."
      ],
      "tools": [
        "C# ASP .NET Core MVC Programming",
        "ORM Entity Framework",
        "JavaScript",
        "Angular",
        "VueJs",
        "HTML/CSS",
        "Accesibility",
        "Postman",
        "SQL Workbench",
        "Postgres",
        "Microsoft Teams",
        "Azure DevOps",
        "Git"
      ]
    },
    {
      "name": "Itaú Bank",
      "url": "https://www.itau.com/",
      "position": "Business Process Analyst",
      "dates": "May 2016 - May 2019",
      "company_type": "International Bank",
      "job_description": "Responsible for identifying areas of improvement in the business processes, developing and implementing new strategies and technologies, and collaborating with stakeholders to ensure alignment and successful adoption of the new procedures.",
      "tasks": [
        "Assess business processes to identify areas for improvement, obstacles and inefficiencies.",
        "Design scalable, efficient, and customer-centric processes, developing process workflow diagrams.",
        "Collaborate with cross-functional teams and stakeholders to implement process changes.",
        "Monitor process audits and evaluate the effectiveness of implemented process.",
        "Create process documentation and guidelines, including standard operating procedures.",
        "Communicate changes internally through daily newsletters."
      ],
      "tools": [
        "Visio/Bizagi",
        "Microsoft Office 365",
        "Clarity"
      ]
    }
  ]
}
